app/Controllers/Produtos.php

    public function listar()
    {
        $produto_model = new ProdutoModel();

        $produtos = $produto_model
                    ->findAll();
---
SELECT *
FROM `produtos`

    public function excluir($ProdutoId)
    {
        $produto_model = new ProdutoModel();
        $produto_model
                    ->where('ProdutoId', $ProdutoId)
                    ->delete();
---
DELETE FROM `produtos`
WHERE `ProdutoId` = ' 7'